Table of Contents
 Class BeamData
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Provides data of the connected beam
[DataContract]
public class BeamData : OpenElementId
Inheritance
object
OpenObject
OpenElementId
BeamData
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 AddedMember
Added member
[DataMember]
public ReferenceElement AddedMember { get; set; }
Property Value
ReferenceElement
 AddedMemberLength
Added beam lenght
[DataMember]
public double AddedMemberLength { get; set; }
Property Value
double
 AutoAddCutByWorkplane
Automaticali add cut by workplane if it not defined
[DataMember]
public bool AutoAddCutByWorkplane { get; set; }
Property Value
bool
 CrossSectionType
Type of cross section
[DataMember]
public string CrossSectionType { get; set; }
Property Value
string
 Cuts
Cuts on the beam
[DataMember]
public List<CutData> Cuts { get; set; }
Property Value
List<CutData>
 IsAdded
Is added beam
[DataMember]
public bool IsAdded { get; set; }
Property Value
bool
 IsBearingMember
Is beam bearing member
[DataMember]
public bool IsBearingMember { get; set; }
Property Value
bool
 IsNegativeObject
Is negative object
[DataMember]
public bool IsNegativeObject { get; set; }
Property Value
bool
 MirrorY
Mirror by Y
[DataMember]
public bool MirrorY { get; set; }
Property Value
bool
 MprlName
MPRL name of beam
[DataMember]
public string MprlName { get; set; }
Property Value
string
 Name
Name of the beam
[DataMember]
public string Name { get; set; }
Property Value
string
 OriginalModelId
Get or set the identification in the original model In the case of the imported connection from another application
[DataMember]
public string OriginalModelId { get; set; }
Property Value
string
 Plates
Plates of the beam
[DataMember]
public List<PlateData> Plates { get; set; }
Property Value
List<PlateData>
 RefLineInCenterOfGravity
The reference line of the member is in the center of gravity of the cross-section
[DataMember]
public bool RefLineInCenterOfGravity { get; set; }
Property Value
bool
 Edit this page